garyPenhook/PyAvrOCD/svd/avr32la28.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIGROW</name>
      <description>Signature row</description>
      <baseAddress>0x00801080</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DEVICEID0</name>
          <description>Device ID Byte 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVICEID1</name>
          <description>Device ID Byte 1</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>DEVICEID2</name>
          <description>Device ID Byte 2</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM0</name>
          <description>Serial Number Byte 0</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM1</name>
          <description>Serial Number Byte 1</description>
          <addressOffset>0x11</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM10</name>
          <description>Serial Number Byte 10</description>
          <addressOffset>0x1A</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM11</name>
          <description>Serial Number Byte 11</description>
          <addressOffset>0x1B</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM12</name>
          <description>Serial Number Byte 12</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM13</name>
          <description>Serial Number Byte 13</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM14</name>
          <description>Serial Number Byte 14</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM15</name>
          <description>Serial Number Byte 15</description>
          <addressOffset>0x1F</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM2</name>
          <description>Serial Number Byte 2</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM3</name>
          <description>Serial Number Byte 3</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM4</name>
          <description>Serial Number Byte 4</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM5</name>
          <description>Serial Number Byte 5</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM6</name>
          <description>Serial Number Byte 6</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM7</name>
          <description>Serial Number Byte 7</description>
          <addressOffset>0x17</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM8</name>
          <description>Serial Number Byte 8</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SERNUM9</name>
          <description>Serial Number Byte 9</description>
          <addressOffset>0x19</addressOffset>
          <size>0x8</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMPSENSE0</name>
          <description>Temperature Calibration 0</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TEMPSENSE1</name>
          <description>Temperature Calibration 1</description>
          <addressOffset>0x6</addressOffset>
          <size>0x10</size>
          <access>read-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
